DataProcessors/ОтчетПродажиИВозвраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>ОтчетПродажиИВозвраты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ОС_ДанныеПродажДляМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОС_ДанныеПродажДляМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПродажиКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПродажиСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратыКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВозвратыСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ОтчетПродажиИВозвраты/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Контрагент = Параметры.Контрагент;
	Дата = Параметры.Дата;
	Операция = Параметры.Операция;
	Заголовок = Операция + " на " + Формат(Дата,"ДЛФ=DD") + " контрагент: " + Контрагент;
	СформироватьОтчет();
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет ()
	Запрос       = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеПродаж.Номенклатура КАК Номенклатура,
	|	ДанныеПродаж.Дата КАК Дата,
	|	ДанныеПродаж.ПродажиСумма КАК Продажи,
	|	ДанныеПродаж.ВозвратыСумма КАК Возвраты,
	|	ДанныеПродаж.ВозвратыКоличество,
	|	ДанныеПродаж.ПродажиКоличество
	|ИЗ
	|	РегистрСведений.ОС_ДанныеПродажДляМП КАК ДанныеПродаж
	|ГДЕ
	|	ДанныеПродаж.Контрагент = &Контрагент
	|	И ДанныеПродаж.Дата = &Дата
	|	И ДанныеПродаж.ПродажиКоличество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура";
	Запрос.УстановитьПараметр("Контрагент" ,Контрагент);
	Запрос.УстановитьПараметр("Дата" ,Дата);
	
	Если Операция = "Возврат" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ПродажиКоличество > 0", "ВозвратыКоличество < 0");
	КонецЕсли;
	
	Итог = 0;
	
	Результат.Очистить();
	
	СЧ = 5;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл		
		НоваяСтрока = Результат.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		Если Операция = "Возврат" Тогда			
			НоваяСтрока.Цена = Выборка.Возвраты / Выборка.ВозвратыКоличество;
			НоваяСтрока.Количество = Выборка.ВозвратыКоличество;
			НоваяСтрока.Сумма = Выборка.Возвраты;
		Иначе
			НоваяСтрока.Цена = Выборка.Продажи / Выборка.ПродажиКоличество;
			НоваяСтрока.Количество = Выборка.ПродажиКоличество;
			НоваяСтрока.Сумма = Выборка.Продажи;
		КонецЕсли;
		Итог = Итог + НоваяСтрока.Сумма;
	КонецЦикла;	
	
	Результат.Сортировать("Номенклатура");
	
	Если Результат.Количество() = 0 Тогда
		Элементы.ДекорацияНетДанных.Заголовок = "<< НЕТ ДАННЫХ >>";
	Иначе
		Элементы.ДекорацияНетДанных.Заголовок = "Итого: " + Итог + " р.";
	КонецЕсли;	
КонецПроцедуры
